#include "View.h"
#include <iostream>
using namespace std;

void View::show_menu_camera(){
   cout << "\n=== Меню управління камерою ===\n"
      << "1. Увімкнути камеру\n"
      << "2. Вимкнути камеру\n"
      << "3. Змінити збільшення\n"
      << "4. Відобразити інформацію\n"
      << "5. Копіювати камеру\n"
      << "6. Назначити максимальне значення zoom\n"
      << "7. Максимальне значення zoom\n"
      << "8. Зробити фото\n"
      << "9. Змінити режим зйомки\n"
      << "0. Вийти\n"
      << "Оберіть дію: ";
}

void View::show_menu_camera_shoting_mode(){
   cout << "Оберіть режим зйомки:\n"
      << "  1 - Auto\n"
      << "  2 - Portrait\n"
      << "  3 - Night\n"
      << "Введіть номер: ";
}
