#include "View.h"
#include <iostream>
using namespace std;

void View::showMenuCamera(){
   cout << "\n=== Меню управління камерою ===\n"
      << "1. Увімкнути камеру\n"
      << "2. Вимкнути камеру\n"
      << "3. Змінити збільшення\n"
      << "4. Відобразити інформацію\n"
      << "5. Копіювати камеру\n"
      << "6. Назначити максимальне значення zoom\n"
      << "7. Максимальне значення zoom\n"
      << "8. Зробити фото\n"
      << "9. Змінити режим зйомки\n"
      << "0. Вийти\n"
      << "Оберіть дію: ";
}

void View::showMenuCameraShootingMode(){
   cout << "Оберіть режим зйомки:\n"
      << "  1 - Auto\n"
      << "  2 - Portrait\n"
      << "  3 - Night\n"
      << "Введіть номер: ";
}

void View::showTypeMenu(){
   cout << "Введіть тип пристрою\n"
      "1 - PhotoCamera\n"
      "2 - OpticalDevice\n"
      "Пристрій №: ";
}

void View::showMenuAddedDevice(){
   cout << "\n=== Меню додавання пристрою ===\n"
      << "1. Додати пристрій на початок\n"
      << "2. Додати пристрій в кінець\n"
      << "3. Додати пристрій на позицію\n"
      << "4. Знайти пристрій\n"
      << "5. Сортувати пристрої\n"
      << "6. Список пристроїв\n"
      << "0. Вийти\n"
      << "Оберіть дію: ";
}
